091
파이썬에서 True 혹은 False를 갖는 데이터 타입은 무엇인가?

def answer():
    print("Boolean")
------------------------------------------------------
092
"""아래 코드의 출력 결과를 예상하라

print(3 == 5)"""
def answer():
    print("False")
------------------------------------------------------
093
"""아래 코드의 출력 결과를 예상하라

print(3 < 5)"""
def answer():
    print("True")
------------------------------------------------------
094
"""아래 코드의 결과를 예상하라.

x = 4
print(1 < x < 5)"""
def answer():
    print("True")
------------------------------------------------------
095
"""아래 코드의 결과를 예상하라.

print ((3 == 3) and (4 != 3))"""
def answer():
    print("True")
------------------------------------------------------
096
"""아래 코드에서 에러가 발생하는 원인에 대해 설명하라.

print(3 => 4)"""
def answer():
    print("기호'='이 왼쪽에 위치해있기 때문이다.오른쪽에 위치하여 >=로 표기해야한다.")
------------------------------------------------------
097
"""아래 코드의 출력 결과를 예상하라

if 4 < 3:
    print("Hello World")"""
def answer():
    print("아무것도 출력되지 않는다.")
------------------------------------------------------
098
"""아래 코드의 출력 결과를 예상하라

if 4 < 3:
    print("Hello World.")
else:
    print("Hi, there.")"""
def answer():
    print("Hi, there.")
------------------------------------------------------
099
"""아래 코드의 출력 결과를 예상하라

if True :
    print ("1")
    print ("2")
else :
    print("3")
print("4")"""
print("1\n2\n4")
------------------------------------------------------
100
"""아래 코드의 출력 결과를 예상하라

if True :
    if False:
        print("1")
        print("2")
    else:
        print("3")
else :
    print("4")
print("5")"""
print("3\n5")
